perftests/run2.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0068 secs
  Slowest:	0.1311 secs
  Fastest:	0.0000 secs
  Average:	0.0085 secs
  Requests/sec:	23564.2892
  
  Total data:	84135142 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [550952]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [133718]	|■■■■■■■■■■
  0.039 [19506]	|■
  0.052 [2414]	|
  0.066 [318]	|
  0.079 [64]	|
  0.092 [29]	|
  0.105 [8]	|
  0.118 [5]	|
  0.131 [3]	|


Latency distribution:
  10% in 0.0006 secs
  25% in 0.0025 secs
  50% in 0.0066 secs
  75% in 0.0122 secs
  90% in 0.0187 secs
  95% in 0.0233 secs
  99% in 0.0335 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1311 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0023 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.0085 secs, 0.0000 secs, 0.1311 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0017 secs

Status code distribution:
  [400]	707018 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61006->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61007->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61008->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61010->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61011->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61012->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61013->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61014->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61015->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61016->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61017->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61018->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61019->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61020->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61021->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61022->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61023->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61024->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61025->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61026->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61027->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61028->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61029->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61030->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61031->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61032->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61033->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61034->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61035->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61036->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61037->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61038->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61039->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61040->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61041->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61042->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61043->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61044->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61045->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61046->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61047->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61048->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61049->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61050->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61051->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61052->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61053->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61054->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61055->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61056->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61057->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61058->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61059->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61060->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61061->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61062->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61063->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61064->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61065->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61066->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61067->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61068->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61069->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61070->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61071->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61072->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61073->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61074->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61075->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61076->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:61077->[::1]:9000: read: connection reset by peer